hpmicro/rtt-bsp-hpm6750evkmini/rtt_default_project_0/libraries/hpm-sdk/soc/ip/hpm_pcfg_regs.h
/*
 * CPU0 (RW)
 *
 * Stop peripheral when CPU0 enter debug mode
 * 0: peripheral keep running when CPU0 in debug mode
 * 1: peripheral enter debug mode when CPU0 enter debug
 */
#define PCFG_DEBUG_STOP_CPU0_MASK (0x1U)
#define PCFG_DEBUG_STOP_CPU0_SHIFT (0U)
#define PCFG_DEBUG_STOP_CPU0_SET(x) (((uint32_t)(x) << PCFG_DEBUG_STOP_CPU0_SHIFT) & PCFG_DEBUG_STOP_CPU0_MASK)
#define PCFG_DEBUG_STOP_CPU0_GET(x) (((uint32_t)(x) & PCFG_DEBUG_STOP_CPU0_MASK) >> PCFG_DEBUG_STOP_CPU0_SHIFT)

/* Bitfield definition for register: IRC24M */
/*
 * IRC_TRIMMED (RW)
 *
 * IRC24M trim happened, this bit set by hardware after trim value loaded, and stop load, write 0 will clear this bit and reload trim value
 * 0: irc is not trimmed
 * 1: irc is trimmed
 */
#define PCFG_IRC24M_IRC_TRIMMED_MASK (0x80000000UL)
#define PCFG_IRC24M_IRC_TRIMMED_SHIFT (31U)
#define PCFG_IRC24M_IRC_TRIMMED_SET(x) (((uint32_t)(x) << PCFG_IRC24M_IRC_TRIMMED_SHIFT) & PCFG_IRC24M_IRC_TRIMMED_MASK)
#define PCFG_IRC24M_IRC_TRIMMED_GET(x) (((uint32_t)(x) & PCFG_IRC24M_IRC_TRIMMED_MASK) >> PCFG_IRC24M_IRC_TRIMMED_SHIFT)

/*
 * TRIM_C (RW)
 *
 * Coarse trim for IRC24M, bigger value means faster
 */
#define PCFG_IRC24M_TRIM_C_MASK (0x700U)
#define PCFG_IRC24M_TRIM_C_SHIFT (8U)
#define PCFG_IRC24M_TRIM_C_SET(x) (((uint32_t)(x) << PCFG_IRC24M_TRIM_C_SHIFT) & PCFG_IRC24M_TRIM_C_MASK)
#define PCFG_IRC24M_TRIM_C_GET(x) (((uint32_t)(x) & PCFG_IRC24M_TRIM_C_MASK) >> PCFG_IRC24M_TRIM_C_SHIFT)

/*
 * TRIM_F (RW)
 *
 * Fine trim for IRC24M, bigger value means faster
 */
#define PCFG_IRC24M_TRIM_F_MASK (0x1FU)
#define PCFG_IRC24M_TRIM_F_SHIFT (0U)
#define PCFG_IRC24M_TRIM_F_SET(x) (((uint32_t)(x) << PCFG_IRC24M_TRIM_F_SHIFT) & PCFG_IRC24M_TRIM_F_MASK)
#define PCFG_IRC24M_TRIM_F_GET(x) (((uint32_t)(x) & PCFG_IRC24M_TRIM_F_MASK) >> PCFG_IRC24M_TRIM_F_SHIFT)

/* Bitfield definition for register: IRC24M_TRACK */
/*
 * SEL24M (RW)
 *
 * Select track reference
 * 0: select 32K as reference
 * 1: select 24M XTAL as reference
 */
#define PCFG_IRC24M_TRACK_SEL24M_MASK (0x10000UL)
#define PCFG_IRC24M_TRACK_SEL24M_SHIFT (16U)
#define PCFG_IRC24M_TRACK_SEL24M_SET(x) (((uint32_t)(x) << PCFG_IRC24M_TRACK_SEL24M_SHIFT) & PCFG_IRC24M_TRACK_SEL24M_MASK)
#define PCFG_IRC24M_TRACK_SEL24M_GET(x) (((uint32_t)(x) & PCFG_IRC24M_TRACK_SEL24M_MASK) >> PCFG_IRC24M_TRACK_SEL24M_SHIFT)

/*
 * RETURN (RW)
 *
 * Retrun default value when XTAL loss
 * 0: remain last tracking value 
 * 1: switch to default value
 */
#define PCFG_IRC24M_TRACK_RETURN_MASK (0x10U)
#define PCFG_IRC24M_TRACK_RETURN_SHIFT (4U)
#define PCFG_IRC24M_TRACK_RETURN_SET(x) (((uint32_t)(x) << PCFG_IRC24M_TRACK_RETURN_SHIFT) & PCFG_IRC24M_TRACK_RETURN_MASK)
#define PCFG_IRC24M_TRACK_RETURN_GET(x) (((uint32_t)(x) & PCFG_IRC24M_TRACK_RETURN_MASK) >> PCFG_IRC24M_TRACK_RETURN_SHIFT)

/*
 * TRACK (RW)
 *
 * track mode
 * 0: IRC24M free running
 * 1: track IRC24M to external XTAL
 */
#define PCFG_IRC24M_TRACK_TRACK_MASK (0x1U)
#define PCFG_IRC24M_TRACK_TRACK_SHIFT (0U)
#define PCFG_IRC24M_TRACK_TRACK_SET(x) (((uint32_t)(x) << PCFG_IRC24M_TRACK_TRACK_SHIFT) & PCFG_IRC24M_TRACK_TRACK_MASK)
#define PCFG_IRC24M_TRACK_TRACK_GET(x) (((uint32_t)(x) & PCFG_IRC24M_TRACK_TRACK_MASK) >> PCFG_IRC24M_TRACK_TRACK_SHIFT)

/* Bitfield definition for register: TRACK_TARGET */
/*
 * PRE_DIV (RW)
 *
 * Divider for reference source
 */
#define PCFG_TRACK_TARGET_PRE_DIV_MASK (0xFFFF0000UL)
#define PCFG_TRACK_TARGET_PRE_DIV_SHIFT (16U)
#define PCFG_TRACK_TARGET_PRE_DIV_SET(x) (((uint32_t)(x) << PCFG_TRACK_TARGET_PRE_DIV_SHIFT) & PCFG_TRACK_TARGET_PRE_DIV_MASK)
#define PCFG_TRACK_TARGET_PRE_DIV_GET(x) (((uint32_t)(x) & PCFG_TRACK_TARGET_PRE_DIV_MASK) >> PCFG_TRACK_TARGET_PRE_DIV_SHIFT)

/*
 * TARGET (RW)
 *
 * Target frequency multiplier of divided source
 */
#define PCFG_TRACK_TARGET_TARGET_MASK (0xFFFFU)
#define PCFG_TRACK_TARGET_TARGET_SHIFT (0U)
#define PCFG_TRACK_TARGET_TARGET_SET(x) (((uint32_t)(x) << PCFG_TRACK_TARGET_TARGET_SHIFT) & PCFG_TRACK_TARGET_TARGET_MASK)
#define PCFG_TRACK_TARGET_TARGET_GET(x) (((uint32_t)(x) & PCFG_TRACK_TARGET_TARGET_MASK) >> PCFG_TRACK_TARGET_TARGET_SHIFT)

/* Bitfield definition for register: STATUS */
/*
 * SEL32K (RO)
 *
 * track is using XTAL32K
 * 0: track is not using XTAL32K
 * 1: track is using XTAL32K
 */
#define PCFG_STATUS_SEL32K_MASK (0x100000UL)
#define PCFG_STATUS_SEL32K_SHIFT (20U)
#define PCFG_STATUS_SEL32K_GET(x) (((uint32_t)(x) & PCFG_STATUS_SEL32K_MASK) >> PCFG_STATUS_SEL32K_SHIFT)

/*
 * SEL24M (RO)
 *
 * track is using XTAL24M
 * 0: track is not using XTAL24M
 * 1: track is using XTAL24M
 */
#define PCFG_STATUS_SEL24M_MASK (0x10000UL)
#define PCFG_STATUS_SEL24M_SHIFT (16U)
#define PCFG_STATUS_SEL24M_GET(x) (((uint32_t)(x) & PCFG_STATUS_SEL24M_MASK) >> PCFG_STATUS_SEL24M_SHIFT)

/*
 * EN_TRIM (RO)
 *
 * default value takes effect
 * 0: default value is invalid
 * 1: default value is valid
 */
#define PCFG_STATUS_EN_TRIM_MASK (0x8000U)
#define PCFG_STATUS_EN_TRIM_SHIFT (15U)
#define PCFG_STATUS_EN_TRIM_GET(x) (((uint32_t)(x) & PCFG_STATUS_EN_TRIM_MASK) >> PCFG_STATUS_EN_TRIM_SHIFT)

/*
 * TRIM_C (RO)
 *
 * default coarse trim value
 */
#define PCFG_STATUS_TRIM_C_MASK (0x700U)
#define PCFG_STATUS_TRIM_C_SHIFT (8U)
#define PCFG_STATUS_TRIM_C_GET(x) (((uint32_t)(x) & PCFG_STATUS_TRIM_C_MASK) >> PCFG_STATUS_TRIM_C_SHIFT)

/*
 * TRIM_F (RO)
 *
 * default fine trim value
 */
#define PCFG_STATUS_TRIM_F_MASK (0x1FU)
#define PCFG_STATUS_TRIM_F_SHIFT (0U)
#define PCFG_STATUS_TRIM_F_GET(x) (((uint32_t)(x) & PCFG_STATUS_TRIM_F_MASK) >> PCFG_STATUS_TRIM_F_SHIFT)




#endif /* HPM_PCFG_H */